tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf24j50_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF24J50_H_
#define _PIC18LF24J50_H_

#define PPSCON                        0
#define IOLOCK                        1
#define UEP0                          2
#define UEP0_EPSTALL                  3
#define EP0STALL                      4
#define EPSTALL0                      5
#define UEP0_EPINEN                   6
#define EPINEN0                       7
#define EP0INEN                       8
#define UEP0_EPOUTEN                  9
#define EP0OUTEN                      10
#define EPOUTEN0                      11
#define EPCONDIS0                     12
#define EP0CONDIS                     13
#define UEP0_EPCONDIS                 14
#define UEP0_EPHSHK                   15
#define EP0HSHK                       16
#define EPHSHK0                       17
#define UEP1                          18
#define EPSTALL1                      19
#define EP1STALL                      20
#define UEP1_EPSTALL                  21
#define EPINEN1                       22
#define EP1INEN                       23
#define UEP1_EPINEN                   24
#define EPOUTEN1                      25
#define UEP1_EPOUTEN                  26
#define EP1OUTEN                      27
#define UEP1_EPCONDIS                 28
#define EP1CONDIS                     29
#define EPCONDIS1                     30
#define EPHSHK1                       31
#define EP1HSHK                       32
#define UEP1_EPHSHK                   33
#define UEP2                          34
#define EP2STALL                      35
#define EPSTALL2                      36
#define UEP2_EPSTALL                  37
#define EP2INEN                       38
#define EPINEN2                       39
#define UEP2_EPINEN                   40
#define EP2OUTEN                      41
#define UEP2_EPOUTEN                  42
#define EPOUTEN2                      43
#define EP2CONDIS                     44
#define UEP2_EPCONDIS                 45
#define EPCONDIS2                     46
#define EP2HSHK                       47
#define EPHSHK2                       48
#define UEP2_EPHSHK                   49
#define UEP3                          50
#define UEP3_EPSTALL                  51
#define EPSTALL3                      52
#define EP3STALL                      53
#define UEP3_EPINEN                   54
#define EPINEN3                       55
#define EP3INEN                       56
#define EP3OUTEN                      57
#define EPOUTEN3                      58
#define UEP3_EPOUTEN                  59
#define UEP3_EPCONDIS                 60
#define EP3CONDIS                     61
#define EPCONDIS3                     62
#define EPHSHK3                       63
#define UEP3_EPHSHK                   64
#define EP3HSHK                       65
#define UEP4                          66
#define EP4STALL                      67
#define EPSTALL4                      68
#define UEP4_EPSTALL                  69
#define UEP4_EPINEN                   70
#define EP4INEN                       71
#define EPINEN4                       72
#define UEP4_EPOUTEN                  73
#define EPOUTEN4                      74
#define EP4OUTEN                      75
#define EPCONDIS4                     76
#define EP4CONDIS                     77
#define UEP4_EPCONDIS                 78
#define EPHSHK4                       79
#define EP4HSHK                       80
#define UEP4_EPHSHK                   81
#define UEP5                          82
#define EP5STALL                      83
#define UEP5_EPSTALL                  84
#define EPSTALL5                      85
#define EPINEN5                       86
#define UEP5_EPINEN                   87
#define EP5INEN                       88
#define EPOUTEN5                      89
#define UEP5_EPOUTEN                  90
#define EP5OUTEN                      91
#define EPCONDIS5                     92
#define EP5CONDIS                     93
#define UEP5_EPCONDIS                 94
#define UEP5_EPHSHK                   95
#define EPHSHK5                       96
#define EP5HSHK                       97
#define UEP6                          98
#define EPSTALL6                      99
#define UEP6_EPSTALL                  100
#define EP6STALL                      101
#define EP6INEN                       102
#define UEP6_EPINEN                   103
#define EPINEN6                       104
#define EP6OUTEN                      105
#define EPOUTEN6                      106
#define UEP6_EPOUTEN                  107
#define UEP6_EPCONDIS                 108
#define EP6CONDIS                     109
#define EPCONDIS6                     110
#define EPHSHK6                       111
#define UEP6_EPHSHK                   112
#define EP6HSHK                       113
#define UEP7                          114
#define UEP7_EPSTALL                  115
#define EP7STALL                      116
#define EPSTALL7                      117
#define EP7INEN                       118
#define EPINEN7                       119
#define UEP7_EPINEN                   120
#define EP7OUTEN                      121
#define UEP7_EPOUTEN                  122
#define EPOUTEN7                      123
#define UEP7_EPCONDIS                 124
#define EP7CONDIS                     125
#define EPCONDIS7                     126
#define EPHSHK7                       127
#define UEP7_EPHSHK                   128
#define EP7HSHK                       129
#define UEP8                          130
#define EPSTALL8                      131
#define UEP8_EPSTALL                  132
#define UEP8_EPINEN                   133
#define EPINEN8                       134
#define UEP8_EPOUTEN                  135
#define EPOUTEN8                      136
#define UEP8_EPCONDIS                 137
#define EPCONDIS8                     138
#define UEP8_EPHSHK                   139
#define EPHSHK8                       140
#define UEP9                          141
#define EPSTALL9                      142
#define UEP9_EPSTALL                  143
#define EPINEN9                       144
#define UEP9_EPINEN                   145
#define UEP9_EPOUTEN                  146
#define EPOUTEN9                      147
#define UEP9_EPCONDIS                 148
#define EPCONDIS9                     149
#define UEP9_EPHSHK                   150
#define EPHSHK9                       151
#define UEP10                         152
#define EPSTALL10                     153
#define UEP10_EPSTALL                 154
#define EPINEN10                      155
#define UEP10_EPINEN                  156
#define UEP10_EPOUTEN                 157
#define EPOUTEN10                     158
#define EPCONDIS10                    159
#define UEP10_EPCONDIS                160
#define UEP10_EPHSHK                  161
#define EPHSHK10                      162
#define UEP11                         163
#define UEP11_EPSTALL                 164
#define EPSTALL11                     165
#define EPINEN11                      166
#define UEP11_EPINEN                  167
#define UEP11_EPOUTEN                 168
#define EPOUTEN11                     169
#define EPCONDIS11                    170
#define UEP11_EPCONDIS                171
#define UEP11_EPHSHK                  172
#define EPHSHK11                      173
#define UEP12                         174
#define EPSTALL12                     175
#define UEP12_EPSTALL                 176
#define UEP12_EPINEN                  177
#define EPINEN12                      178
#define EPOUTEN12                     179
#define UEP12_EPOUTEN                 180
#define EPCONDIS12                    181
#define UEP12_EPCONDIS                182
#define EPHSHK12                      183
#define UEP12_EPHSHK                  184
#define UEP13                         185
#define UEP13_EPSTALL                 186
#define EPSTALL13                     187
#define EPINEN13                      188
#define UEP13_EPINEN                  189
#define UEP13_EPOUTEN                 190
#define EPOUTEN13                     191
#define EPCONDIS13                    192
#define UEP13_EPCONDIS                193
#define EPHSHK13                      194
#define UEP13_EPHSHK                  195
#define UEP14                         196
#define UEP14_EPSTALL                 197
#define EPSTALL14                     198
#define EPINEN14                      199
#define UEP14_EPINEN                  200
#define UEP14_EPOUTEN                 201
#define EPOUTEN14                     202
#define EPCONDIS14                    203
#define UEP14_EPCONDIS                204
#define UEP14_EPHSHK                  205
#define EPHSHK14                      206
#define UEP15                         207
#define UEP15_EPSTALL                 208
#define EPSTALL15                     209
#define UEP15_EPINEN                  210
#define EPINEN15                      211
#define UEP15_EPOUTEN                 212
#define EPOUTEN15                     213
#define EPCONDIS15                    214
#define UEP15_EPCONDIS                215
#define UEP15_EPHSHK                  216
#define EPHSHK15                      217
#define UIE                           218
#define URSTIE                        219
#define UERRIE                        220
#define ACTVIE                        221
#define TRNIE                         222
#define IDLEIE                        223
#define STALLIE                       224
#define SOFIE                         225
#define UEIE                          226
#define PIDEE                         227
#define CRC5EE                        228
#define CRC16EE                       229
#define DFN8EE                        230
#define BTOEE                         231
#define BTSEE                         232
#define UADDR                         233
#define ADDR                          234
#define ADDR0                         235
#define ADDR1                         236
#define ADDR2                         237
#define ADDR3                         238
#define ADDR4                         239
#define ADDR5                         240
#define ADDR6                         241
#define UCFG                          242
#define UPP0                          243
#define PPB0                          244
#define UPP1                          245
#define PPB1                          246
#define FSEN                          247
#define UTRDIS                        248
#define UPUEN                         249
#define UOEMON                        250
#define UTEYE                         251
#define PADCFG1                       252
#define PMPTTL                        253
#define RTSECSEL0                     254
#define RTSECSEL1                     255
#define REFOCON                       256
#define RODIV0                        257
#define RODIV                         258
#define RODIV1                        259
#define RODIV2                        260
#define RODIV3                        261
#define ROSEL                         262
#define ROSSLP                        263
#define ROON                          264
#define RTCCAL                        265
#define CAL0                          266
#define CAL                           267
#define CAL1                          268
#define CAL2                          269
#define CAL3                          270
#define CAL4                          271
#define CAL5                          272
#define CAL6                          273
#define CAL7                          274
#define RTCCFG                        275
#define RTCPTR0                       276
#define RTCPTR1                       277
#define RTCOE                         278
#define HALFSEC                       279
#define RTCSYNC                       280
#define RTCWREN                       281
#define RTCEN                         282
#define ODCON3                        283
#define SPI1OD                        284
#define SPI2OD                        285
#define ODCON2                        286
#define U1OD                          287
#define U2OD                          288
#define ODCON1                        289
#define ECCP1OD                       290
#define ECCP2OD                       291
#define ANCON0                        292
#define PCFG0                         293
#define PCFG1                         294
#define PCFG2                         295
#define PCFG3                         296
#define PCFG4                         297
#define ANCON1                        298
#define PCFG8                         299
#define PCFG9                         300
#define PCFG10                        301
#define PCFG11                        302
#define PCFG12                        303
#define PCFG14                        304
#define VBG2EN                        305
#define PCFG15                        306
#define VBGEN                         307
#define DSWAKEL                       308
#define DSPOR                         309
#define DSMCLR                        310
#define DSRTC                         311
#define DSWDT                         312
#define DSULP                         313
#define DSFLT                         314
#define DSWAKEH                       315
#define DSINT0                        316
#define DSCONL                        317
#define RELEASE                       318
#define DSBOR                         319
#define ULPWDIS                       320
#define DSCONH                        321
#define RTCWDIS                       322
#define DSULPEN                       323
#define DSEN                          324
#define DSGPR0                        325
#define DSGPR1                        326
#define TCLKCON                       327
#define T3CCP1                        328
#define T3CCP2                        329
#define T1RUN                         330
#define CVRCON                        331
#define CVR                           332
#define CVR0                          333
#define CVR1                          334
#define CVR2                          335
#define CVR3                          336
#define CVRSS                         337
#define CVRR                          338
#define CVROEN                        339
#define CVROE                         340
#define CVREN                         341
#define UFRML                         342
#define FRML                          343
#define FRM0                          344
#define UFRML_FRM                     345
#define FRM1                          346
#define FRM2                          347
#define FRM3                          348
#define FRM4                          349
#define FRM5                          350
#define FRM6                          351
#define FRM7                          352
#define UFRMH                         353
#define FRM8                          354
#define UFRMH_FRM                     355
#define FRM9                          356
#define FRM10                         357
#define UIR                           358
#define URSTIF                        359
#define UERRIF                        360
#define ACTVIF                        361
#define TRNIF                         362
#define IDLEIF                        363
#define STALLIF                       364
#define SOFIF                         365
#define UEIR                          366
#define PIDEF                         367
#define CRC5EF                        368
#define CRC16EF                       369
#define DFN8EF                        370
#define BTOEF                         371
#define BTSEF                         372
#define USTAT                         373
#define PPBI                          374
#define DIR                           375
#define ENDP                          376
#define ENDP0                         377
#define ENDP1                         378
#define ENDP2                         379
#define ENDP3                         380
#define UCON                          381
#define SUSPND                        382
#define RESUME                        383
#define USBEN                         384
#define PKTDIS                        385
#define SE0                           386
#define PPBRST                        387
#define DMABCH                        388
#define DMACNTHB                      389
#define DMABCL                        390
#define DMACNTLB                      391
#define RXADDRH                       392
#define DMARCPTRHB                    393
#define RXADDRL                       394
#define DMARCVPTRLB                   395
#define TXADDRH                       396
#define DMATXPTRHB                    397
#define TXADDRL                       398
#define DMATXPTRLB                    399
#define CMSTAT                        400
#define COUT1                         401
#define COUT2                         402
#define SSP2CON2                      403
#define SEN2                          404
#define SSP2CON2_SEN                  405
#define ADMSK12                       406
#define SSP2CON2_RSEN                 407
#define RSEN2                         408
#define SSP2CON2_ADMSK1               409
#define ADMSK22                       410
#define PEN2                          411
#define SSP2CON2_PEN                  412
#define SSP2CON2_ADMSK2               413
#define ADMSK32                       414
#define SSP2CON2_RCEN                 415
#define RCEN2                         416
#define SSP2CON2_ADMSK3               417
#define ACKEN2                        418
#define ADMSK42                       419
#define SSP2CON2_ADMSK4               420
#define SSP2CON2_ACKEN                421
#define ACKDT2                        422
#define ADMSK52                       423
#define SSP2CON2_ACKDT                424
#define SSP2CON2_ADMSK5               425
#define SSP2CON2_ACKSTAT              426
#define ACKSTAT2                      427
#define SSP2CON2_GCEN                 428
#define GCEN2                         429
#define SSP2CON1                      430
#define SSP2CON1_SSPM                 431
#define SSP2CON1_SSPM0                432
#define SSPM02                        433
#define SSPM12                        434
#define SSP2CON1_SSPM1                435
#define SSP2CON1_SSPM2                436
#define SSPM22                        437
#define SSPM32                        438
#define SSP2CON1_SSPM3                439
#define SSP2CON1_CKP                  440
#define CKP2                          441
#define SSPEN2                        442
#define SSP2CON1_SSPEN                443
#define SSPOV2                        444
#define SSP2CON1_SSPOV                445
#define WCOL2                         446
#define SSP2CON1_WCOL                 447
#define SSP2STAT                      448
#define SSP2STAT_BF                   449
#define BF2                           450
#define SSP2STAT_UA                   451
#define UA2                           452
#define RW2                           453
#define READ_WRITE2                   454
#define nW2                           455
#define I2C_READ2                     456
#define SSP2STAT_R_NOT_W              457
#define R_nW2                         458
#define nWRITE2                       459
#define R_W2                          460
#define SSP2STAT_R_nW                 461
#define SSP2STAT_S                    462
#define S2                            463
#define START2                        464
#define I2C_START2                    465
#define P2                            466
#define SSP2STAT_P                    467
#define STOP2                         468
#define I2C_STOP2                     469
#define I2C_DAT2                      470
#define DATA_ADDRESS2                 471
#define SSP2STAT_D_NOT_A              472
#define D_A2                          473
#define SSP2STAT_D_nA                 474
#define nA2                           475
#define DA2                           476
#define nADDRESS2                     477
#define D_nA2                         478
#define SSP2STAT_CKE                  479
#define CKE2                          480
#define SSP2STAT_SMP                  481
#define SMP2                          482
#define SSP2ADD                       483
#define SSP2ADD_SSPADD                484
#define MSK02                         485
#define SSP2ADD_MSK0                  486
#define MSK12                         487
#define SSP2ADD_MSK1                  488
#define MSK22                         489
#define SSP2ADD_MSK2                  490
#define MSK32                         491
#define SSP2ADD_MSK3                  492
#define MSK42                         493
#define SSP2ADD_MSK4                  494
#define MSK52                         495
#define SSP2ADD_MSK5                  496
#define MSK62                         497
#define SSP2ADD_MSK6                  498
#define MSK72                         499
#define SSP2ADD_MSK7                  500
#define SSP2BUF                       501
#define SSP2BUF_SSPBUF                502
#define T4CON                         503
#define T4CKPS0                       504
#define T4CKPS                        505
#define T4CKPS1                       506
#define TMR4ON                        507
#define T4OUTPS                       508
#define T4OUTPS0                      509
#define T4OUTPS1                      510
#define T4OUTPS2                      511
#define T4OUTPS3                      512
#define PR4                           513
#define TMR4                          514
#define T3CON                         515
#define TMR3ON                        516
#define T3CON_RD16                    517
#define T3SYNC                        518
#define SOSCEN3                       519
#define T3OSCEN                       520
#define T3CKPS                        521
